application/models/CRM-PIPESTAGE-CRT.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:adin="http://3e.pl/ADInterface">
   <soapenv:Header/>
   <soapenv:Body>
      <adin:createData>
         <adin:ModelCRUDRequest>
            <adin:ModelCRUD>
               <adin:serviceType>API-PIPESTAGE-CRT</adin:serviceType>
               <!--Optional:-->
               <adin:DataRow>
                  <!--Zero or more repetitions:-->
                  <adin:field column="Name">
                     <adin:val>[name]</adin:val>
                  </adin:field>
                  <adin:field column="Description">
                     <adin:val>[description]</adin:val>
                  </adin:field>
                  <adin:field column="XX_SalesTeam_ID">
                     <adin:val>[XX_SalesTeam_ID]</adin:val>
                  </adin:field>
                  <adin:field column="Reference">
                     <adin:val>WEB</adin:val>
                  </adin:field>
               </adin:DataRow>
            </adin:ModelCRUD>
                <adin:ADLoginRequest>
                    <adin:user>[user]</adin:user>
                    <adin:pass>[pass]</adin:pass>
                    <adin:lang>192</adin:lang>
                    <adin:ClientID>[adclient]</adin:ClientID>
                    <adin:RoleID>[roleid]</adin:RoleID>
                    <adin:OrgID>[orgid]</adin:OrgID>
                    <adin:WarehouseID>[whid]</adin:WarehouseID>
                </adin:ADLoginRequest>
         </adin:ModelCRUDRequest>
      </adin:createData>
   </soapenv:Body>
</soapenv:Envelope>